[
  {
    "event_title": "Eyewitness to Conflict: Prints Commemorating the 80th Anniversary of the End of WWII",
    "event_summary": "Marking the 80thanniversary of the end of World War II, this exhibition features WWII prints from the Sheryl and John L. Fiegel ’65 Collection. It brings together powerful works that reflect the vital role artists played in shaping the public consciousness of war and memory.",
    "event_dates": "20251005,20251007,20251008,20251009,20251010,20251011,20251012",
    "event_url": "https://calendar.tamu.edu/event/358952-eyewitness-to-conflict-wwii-prints-commemorating",
    "event_description": "Exhibition on Display: July 31–Aug. 25, 2025Summer Hours | May 13–Aug. 25, 2025Tues.–Fri. 9 a.m.–5:30 p.m.; Sat. Noon–6 p.m; Closed Sun.–Mon.Regular Hours | Beginning Aug. 26, 2025Tues.–Fri. 9 a.m.–8 p.m.; Sat.–Sun. Noon–6 p.m; Closed Mon.Comprised of lithographs, woodcuts and etchings, this exhibition brings together powerful works that reflect the vital role artists played—and continue to play—in shaping the public consciousness of war and memory. These prints serve as both documentary records and poetic interpretations, capturing not only the devastation and resilience of people and places but also the emotional landscape of a world transformed by conflict.Drawing on Francis Brennan’s 1942 call that the American people needed their artists “to charge them with the grave responsibility of spelling out their anger, their grief, their greatness and their justice,” the exhibition honors those who responded through the enduring medium of printmaking—bearing witness, telling stories that history books cannot and offering deeply personal visions of collective experience.",
    "event_category": "academic calendar, arts entertainment, campus life, general interest, international students, faculty, researcher, residents, staff, students, visitors, youth (k-12), bryan-college station"
  },
  {
    "event_title": "A Growing Legacy",
    "event_summary": "This exhibition celebrates the enduring legacy of the 1989 Runyon Family donation of 19thand 20thcentury art and decorative art and other complementary donations from private collectors.",
    "event_dates": "20251005,20251007,20251008,20251009,20251010,20251011,20251012,20251014,20251015,20251016,20251017,20251018,20251019,20251021,20251022,20251023,20251024,20251025,20251026,20251028,20251029,20251030,20251031",
    "event_url": "https://calendar.tamu.edu/event/364759-a-growing-legacy",
    "event_description": "Exhibition on Display: Sept. 9–Dec. 14, 2025Tues.–Fri. 9 a.m.–8 p.m.; Sat.–Sun. Noon–6 p.m.Since 1989 when the Runyon family donated a fantastic collection of 19thand 20thcentury art and decorative art, the Forsyth Galleries has set about amassing a fantastic collection that we enjoy sharing with the community. Those who love and appreciate the collection have, in turn, donated or loaned a significant number of items including paperweights, Asian art, early American pewter, American Brilliant Cut Crystal, 19thcentury quilts, small furniture items, as well as additional paintings, works on paper and art glass. This exhibition celebrates their generosity and, we hope, will inspire others to share their treasures with the University. THANK YOU!To inquire about donating works of late 19thand early 20thart or to make a contribution to the Forsyth Galleries, contact Assistant Director and Curator Elizabeth Appleby ateappleby@tamu.edu.",
    "event_category": "academic calendar, arts entertainment, campus life, deadlines, general interest, international students, faculty, researcher, residents, staff, students, visitors, youth (k-12), bryan-college station"
  },
  {
    "event_title": "Vessels of Devotion",
    "event_summary": "taylor barnes is a contemporary fibers artist and ceramicist. Her work consists primarily of mixed media fibers techniques and charcoal on cloth.",
    "event_dates": "20251005,20251007,20251008,20251009,20251010,20251011,20251012,20251014,20251015,20251016,20251017,20251018,20251019,20251021,20251022,20251023,20251024,20251025,20251026,20251028,20251029,20251030,20251031",
    "event_url": "https://calendar.tamu.edu/event/365333-vessels-of-devotion",
    "event_description": "Exhibition on Display: Sept. 25–Dec. 13, 2025Tues.–Fri. 9 a.m.–8 p.m.; Sat.–Sun. Noon–6 p.m.barnes’ work takes on subjects of spirituality, oral histories, power, and bell hooks philosophies testing the object/subject divide. Her figures are to be understood as her spiritual guides unbound by time. Her objects contain undeniable presences as activation of the inanimate is at the core of her practice. All this, guiding her to construct spaces in which their truths are revealed.",
    "event_category": "academic calendar, arts entertainment, campus life, general interest, international students, faculty, researcher, residents, staff, students, visitors, youth (k-12), bryan-college station"
  },
  {
    "event_title": "OPAS presents Mrs. Doubtfire",
    "event_summary": "OPAS presentsMrs. Doubtfirethe musical in Rudder Auditorium on October 7 & 8 (7:30 PM). Tickets available atMSC Box Office.",
    "event_dates": "20251007,20251008",
    "event_url": "https://calendar.tamu.edu/event/354703-opas-presents-mrs-doubtfire",
    "event_description": "A new musical comedy about the things we do to stay together.Everyone’s favorite Scottish nanny is headed to College Station in this internationally acclaimed hit musical critics call “wonderful, heartwarming, and laugh-out-loud funny” (Manchester Evening News) and “a feel-good, family-friendly comedy that delivers” (The Hollywood Reporter). Based on the beloved film,MRS. DOUBTFIREtells the hysterical and heartfelt story of an out-of-work actor who will do anything for his kids. It’s “the lovable, big-hearted musical comedy we need right now,” raves theChicago Tribune– one that proves we’re better together.MATURE THEMESVisitMrs. Doubtfirefor more information about this program. Order tickets now at the Box Office.  To see all of the shows coming to OPAS Season 53, visit our fullschedule page.",
    "event_category": "arts entertainment, campus life, general interest, international students, faculty, residents, staff, students, visitors, youth (k-12), bryan-college station"
  },
  {
    "event_title": "Silver Taps",
    "event_summary": "Silver Taps is that final tribute paid to an Aggie who, at the time of their death, was enrolled in professional, graduate or undergraduate courses at Texas A&M.View this month’s honorees",
    "event_dates": "20251007",
    "event_url": "https://calendar.tamu.edu/event/357586-silver-taps",
    "event_description": "The ceremony begins on the day of Silver Taps when the flag in front of the Academic Building is placed at half-staff. Notices are posted at the Memorial Student Center, Evans Library, and at the base of the flagpole in front of the Academic Building. At 10:15 p.m., chimes from the Albritton Bell Tower begin to play. The ceremony begins at 10:30 p.m. as the Ross Volunteers Firing Squad marches in slow cadence to the statue of Lawrence Sullivan Ross. Three volleys are fired. “Silver Taps” is played by six buglers three times – to the North, West, and South. This concludes the ceremony, but not the feelings of respect and honor.With respect, the ceremony of Silver Taps is dedicated to the deceased Aggie and is a solemn and serious event. Some important observances must be remembered:The area in front of the Sul Ross statue and the Academic Building is reserved for the friends and family of the deceased.Aggies do not stand or sit on the benches lining the walkway between the flagpole and the Sul Ross Statue.The darkness and quiet, which cover the campus, emphasize the mood for Silver Taps. Aggies help to retain this tranquility by covering windows, keeping noise to a minimum, and walking to and from the ceremony without talking.The name of the deceased Aggie is posted on the flagpole base during the day of Silver Taps.",
    "event_category": "campus life, general interest, faculty, staff, students, visitors, bryan-college station"
  },
  {
    "event_title": "Printmaking Workshop",
    "event_summary": "Join our curator of education to create your very own linocut print! Choose from one of our designs or create your own unique masterpiece.",
    "event_dates": "20251008",
    "event_url": "https://calendar.tamu.edu/event/364738-printmaking-workshop",
    "event_description": "You can also draw inspiration from the printworks in our current exhibition on display, “Eyewitness to Conflict: Prints Commemorating the 80th Anniversary of the End of WWII.”No experience necessary. This event is free and all supplies will be provided.Sign up at:TX.AG/Printing",
    "event_category": "academic calendar, arts entertainment, campus life, general interest, international students, training workshops, faculty, researcher, residents, staff, students, visitors, bryan-college station"
  },
  {
    "event_title": "Texas A&M Singing Cadets Concert",
    "event_summary": "Come see our Friday night concert, performed by the Texas A&M Singing Cadets!",
    "event_dates": "20251010",
    "event_url": "https://calendar.tamu.edu/event/364235-texas-aampm-singing-cadets-concert",
    "event_description": "FREE Friday Home Game Texas A&M Singing Cadets Concert in the Memorial Student Center Flag Room at 5:00 pm. The public is invited.",
    "event_category": "arts entertainment, campus life, general interest, sports athletics, faculty, residents, staff, students, visitors, bryan-college station"
  },
  {
    "event_title": "Maroon & White Night",
    "event_summary": "TAMU & System faculty, staff and their families are invited to downtown Bryan the Third Friday of every month to experience live entertainment, vibrant art, local cuisines, unique bars and exclusive shops.",
    "event_dates": "20251017",
    "event_url": "https://calendar.tamu.edu/event/358133-maroon-white-night",
    "event_description": "Maroon & White Night provides an opportunity to meet up with colleagues to network, socialize and collaborate. Each month a different area on campus will be highlighted to share their impact and potentially inspire cross-campus collaboration.The event is FREE to attend and FREE PARKING is provided in the Roy Kelly Parking Garage. Many businesses are offering incentives and discounts. Make sure to bring your ID or business cards for verification.Visithttps://www.bryantx.gov/maroonwhitenight/for a full list of entertainment and incentives being offered.",
    "event_category": "academic calendar, arts entertainment, campus life, general interest, faculty, researcher, residents, staff, bryan-college station"
  },
  {
    "event_title": "OPAS presents Soweto Gospel Choir - Peace",
    "event_summary": "OPAS presentsSoweto Gospel Choir - Peacein Rudder Auditorium on October 21 (7:30 PM).  Tickets available atMSC Box Office.",
    "event_dates": "20251021",
    "event_url": "https://calendar.tamu.edu/event/354783-opas-presents-soweto-gospel-choir-peace",
    "event_description": "With their concert entitled “PEACE,” the multi-Grammy® and Emmy Award®-winningSOWETO GOSPEL CHOIRreturns to North America to perform a joyful program of South African freedom songs, traditional spirituals and some classics. The inspirational concert will also feature the spirited music of Aretha Franklin, Harry Belafonte, Leonard Cohen and more! Formed in 2002, the Choir was created to celebrate the unique power of African gospel music and quickly established itself as a group that is “undeniably synchronized, appears unshakable, and simultaneously expresses universality and individuality” (San Francisco Classical Voice). Heralded by Nelson Mandela, Desmond Tutu, and Oprah Winfrey,SOWETO GOSPEL CHOIRexcites audiences worldwide, uplifting the soul and spreading joy through its earthy rhythms, rich harmonies, brilliant costumes, and infectious spirit. It’s perfect for the entire family!VisitSoweto Gospel Choir - Peacefor more information about this program. Order tickets now at the Box Office. To see all of the shows coming to OPAS Season 53, visit our fullschedule page.",
    "event_category": "academic calendar, arts entertainment, campus life, general interest, international students, faculty, researcher, residents, staff, students, visitors, youth (k-12), bryan-college station"
  }
]